# IsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexBuffer..::..IsValid Method
IndexBuffer Class See Also
---
Tests whether the buffer is valid for rendering.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
True if the buffer is valid for rendering, false otherwise.
# Remarks
The buffers are internally associated with low-level graphics state and may become invalidated when the state changes. Therefore, an application should test each buffer for validity before submitting its contents for rendering. If the buffer becomes invalid, the application should re-create its contents and write them to a new buffer.
# See Also
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace